[
 {
    "title": "Bit to Byte",
    "speaker": [{
        "name": "Christopher Wright",
        "speaker_id": "cwright",
        "company": "Infogressive",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "cwright.png",
        "bio": "Husband, Father, Homebrewer, Ham, Hacker."
    }],
    "talk_id": "zhero",
    "pdf": "K2020_cwright.pdf",
    "video": "https://www.youtube.com/watch?v=FVZvtv2JUFA",
    "length": "20",
    "technical": "1",
    "abstract": "Having to start over again after being fired from a 5-year job, I saw the trend of hacks and saw that cybersecurity was going to be a low unemployment industry. I went back to college and started this new career path at the age of 34. This presentation will showcase the path I have made going from graduating college with a BSIT degree and zero industry experience to getting a SoC analyst job to becoming a project engineer inside of 1 year from date of hire."
  },{
    "title": "Protecting your Small or Medium Business from Cyber Attacks",
    "speaker": [{
        "name": "Jeff Struik",
        "speaker_id": "jstruik",
        "company": "Cyber Strike Solutions",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Jeff is an experienced cyber security expert with a strong background in the defense industry. He has his Doctor of Computer Science with a Cyber Security concentration, as well has his CISSP, PenTest+, and Network+. Jeff has a passion for the security of embedded systems and a love of sharing knowledge for the betterment of the security community."
    }],
    "talk_id": "smb",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=qtMapKmSFUc",
    "length": "60",
    "technical": "2",
    "abstract": "Small and Medium businesses are prime targets for malicious actors. Lacking the budgetary freedom that larger businesses may have for cyber security and limited personnel resources presents a large bullseye on many small and medium business. This talk addresses various free or built-in options for an organization to use to protect their systems from cyber attacks and reduce their attackable surface."
  },{
    "title": "Adventures in Creating a Cybersecurity Dataset",
    "speaker": [{
        "name": "Heather Lawrence",
        "speaker_id": "hlawrence",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "hlawrence.jpg",
        "bio": "Heather Lawrence is a data scientist for the Nebraska Applied Research Institute who earned her undergraduate and masters degrees in Computer Engineering from the University of Central Florida. In previous lives she was a USN nuke, VA photographer, NCCDC winner, Hack@UCF mom, and darknet marketplace miner. Her current research centers on the application of machine learning to intrusion detection. She serves the community through volunteer work for Kernelcon and DEF CON as well as facilitating logistics as a member of the VetSec and B-Sides Orlando boards."
    }],
    "talk_id": "cyberdata",
    "pdf": "K2020_hlawrence.pdf",
    "video": "https://www.youtube.com/watch?v=JCTI4fZfxgU",
    "length": "60",
    "technical": "2",
    "abstract": "While the foray to apply machine learning to information security is new, there remain challenges to creating and accessing datasets that are beneficial to security research. This talk is going to discuss our journey in creating an open-source network security dataset, the community-accepted guidelines to creating good data, and the challenges we faced. Moreover, this talk examines the gap between academic datasets and data released by the professional community before providing resources to new datasets that have been released in neighboring areas."
  },{
    "title": "Building a Vulnerability Management Program - Avoiding Pitfalls, Managing Risk, and Mastering CYA",
    "speaker": [{
        "name": "Megan Benoit",
        "speaker_id": "mbenoit",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "mbenoit.jpg",
        "bio": "Megan Benoit has spent most of the last 20 years building vulnerability management and incident response programs, architecting and deploying security solutions, and asking people if they’ve tried turning it off and on again. Megan currently works as a Senior Network Security Engineer and has worked for the DoD, healthcare, and retail industries. Her hobbies include chasing pokemon, denying firewall change requests, and yoga, recently completing a 200 hour yoga teacher training course."
    }],
    "talk_id": "cya",
    "pdf": "K2020_mbenoit.pdf",
    "video": "https://www.youtube.com/watch?v=UuLxACx3MEM",
    "length": "60",
    "technical": "3",
    "abstract": "Building a vulnerability management program often feels like eating an elephant that’s guarded by sharks — every time you try to take a bite, you’re dodging someone that’s trying to take a bite out of you. I am going to walk you through building an effective vulnerability management program: avoiding and mitigating common problems, navigating the organizational waters, and getting the most bang for your buck when it comes to reducing your risk. Vulnerability management is more than just running a scan and putting in tickets for remediation — it’s about managing the people involved in the scanning and remediation processes and finding a middle ground that reduces your risk and makes operations happy."
  },{
    "title": "The DIY Artificial Pancreas: Hacking Wetware with Open Source Software and Hardware",
    "speaker": [{
        "name": "Jay Lagorio",
        "speaker_id": "jlagorio",
        "company": "",
        "twitter": "@jaylagorio",
        "github": "",
        "linkedin": "",
        "image": "jlagorio.jpg",
        "bio": "Jay Lagorio, software engineer and independent security researcher, has been building computers and networks and writing code nearly his entire life. He received a B.S. in Computer Science from UMBC in 2008 and an M. Eng. from the Naval Postgraduate School in 2015. He's a Private Investigator in Washington, DC and specializes in Windows development and OSINT."
    }],
    "talk_id": "diypancreas",
    "pdf": "K2020_jlagorio.pdf",
    "video": "https://www.youtube.com/watch?v=LCCrjU70ZDg",
    "length": "60",
    "technical": "3",
    "abstract": "Technology to manage diabetes revolves around stagnated tech from the 80s and 90s. Hackers took their lives into their own hands by developing open source hardware and software to augment inadequate products. Developing and building a DIY artificial pancreas, its iterations, and real-life examples of will be discussed and at least one will be working on the presenter. Taking the human out of the loop and replacing them with technology increases quality of life. See what happens when hackers decide they’re not waiting around for government and the MedTech industry to do better.  Managing diabetes revolves around stagnated tech from the 80s and 90s. Hackers took their lives into their hands by augmenting inadequate products after market. Building iterations of a DIY artificial pancreas and real-life examples of will be discussed and at least one will be working on the presenter. Replacing human intervention with technology betters quality of life. See what happens when hackers decide they’re not waiting around for government and the MedTech industry to do better."
  },{
    "title": "Attacking Secondary Contexts in Web Applications",
    "speaker": [{
        "name": "Sam Curry",
        "speaker_id": "scurry",
        "company": "",
        "twitter": "@samwcyo",
        "github": "",
        "linkedin": "",
        "image": "scurry.png",
        "bio": "Sam Curry is a full time bug bounty hunter and security consultant through 17security, LLC. He has been active in the security community since 2015 and runs a blog dedicated to advancing web application security research at samcurry.net."
    }],
    "talk_id": "webcontext",
    "pdf": "K2020_scurry.pdf",
    "video": "https://www.youtube.com/watch?v=hWmXEAi9z5w",
    "length": "60",
    "technical": "3",
    "abstract": "This talk explores attacking various 'secondary contexts' in web applications where data is being passed to an underlying internal HTTP server.  We will explore the different approaches to targeting limited-access/internal APIs, the very strange interactions between different servers within the stack, and lastly the different types of vulnerabilities present in second stage HTTP services."
  },{
    "title": "Key Duplication - It's not just for the movies!",
    "speaker": [{
        "name": "Tony Virelli",
        "speaker_id": "tvirelli",
        "company": "",
        "twitter": "@virelli",
        "github": "",
        "linkedin": "",
        "image": "tvirelli.jpg",
        "bio": "Tony is a full time web developer with a love of locksport and physical pen testing. He is a member of TOOOL in Des Monies, Iowa. He is a proud father and lucky husband."
    }],
    "talk_id": "keydup",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=Mh5bE7Ur2ko",
    "length": "60",
    "technical": "2",
    "abstract": "Have you ever seen someone just walking around with a key hanging on thier belt? How about a wall of keys behind a security desk? Better yet, has anyone you know every posted a picture of the keys to the new home they just bought? Well, what if you could take a picture and easily duplicate that key with a 3D Printer? Sound like something from a James Bond film? Well it's not! Better yet, if you can just get a moment alone with a key, you can get an imprint of it in less than 2 minutes, return the key to the owner and then cast a duplicate of that key for later use."
  },{
    "title": "Dispelling myths of red/blue cyber competition through metrics",
    "speaker": [{
        "name": "Kandy Phan",
        "speaker_id": "kphan",
        "company": "Sandia",
        "twitter": "@kphan451",
        "github": "",
        "linkedin": "",
        "image": "kphan.jpg",
        "bio": "Kandy is a cybersecurity researcher and red team lead."
    }],
    "talk_id": "redbluemetrics",
    "pdf": "K2020_kphan.pdf",
    "length": "20",
    "technical": "1",
    "abstract": "The DOE CyberForce Competition is an annual college event where student defenders compete against each other, defending their systems from red teams. The goal of this competition is to improve the technical skill sets of the students to prepare them for the work force. However, just randomly throwing red and blue teams together hoping that magic will happen is a recipe for disaster. But it’s hard to correct deep-seated wrong views about these cyber competitions.  So this year, at the Albuquerque site, we developed a process and automated tooling to collect data during the competition to answer questions such as the average number of vulnerabilities patched before game start time, ability for lateral movement without initial access, detection rate of more advanced C2, etc.  This data is really important for us to get insights about the competition so that we can improve it for the students. Hopefully, more competitions will start collecting these types of metrics so that we can improve the state of cyber education events."
  },{
    "title": "How Ghidra changed my life",
    "speaker": [{
        "name": "Chris Eagle",
        "speaker_id": "ceagle",
        "company": "",
        "twitter": "@sk3wl",
        "github": "",
        "linkedin": "",
        "image": "ceagle.png",
        "bio": "Chris Eagle is a security researcher whose interests include computer network operations, computer forensics and reverse/anti-reverse engineering. He was the chief architect of the competition infrastructure for DARPA's Cyber Grand Challenge. He has been a speaker at conferences such as Kernelcon, Blackhat, and Defcon and is the author of 'The IDA Pro Book'. In his spare time he is an inveterate CTF player and has twice won the prestigious capture the flag competition at Defcon."
    }],
    "talk_id": "ghidra4life",
    "pdf": "K2020_ceagle.pdf",
    "video": "https://www.youtube.com/watch?v=KL1jE9dxas0",
    "length": "60",
    "technical": "4",
    "abstract": "Anyone that knows me also knows that I'm a huge IDA Pro fanboy. Ghidra, the NSA's answer to IDA, has been in the public's hands for about a year now, so where does that leave me?  Still solidly in the IDA camp, but that doesn't mean that Ghidra hasn't had an impact on my life. Thanks to the magic of open source we can take one of Ghidra's nicest features and bolt it onto IDA to fill some gaps in IDA coverage. In this talk, I'll introduce the 'Binary Lifting Component' (it's kinder name), or just blc for short, plugin for IDA.  blc takes the core of Ghidra's decompiler capability and builds an IDA plugin around it to add decompilation capability to IDA for all processors supported by Ghidra."
  },{
    "title": "Exploiting Modern Desktop Applications",
    "speaker": [{
        "name": "Matt Austin",
        "speaker_id": "maustin",
        "company": "",
        "twitter": "@mattaustin",
        "github": "",
        "linkedin": "",
        "image": "matt.png",
        "bio": "Matt Austin is a security researcher and bug bounty hunter with 15 years of appsec experience. He is also the Director of Security Research at Contrast Security focused on runtime security assessment and protection through instrumentation."
    }],
    "talk_id": "exploitdesktop",
    "pdf": "",
    "length": "60",
    "technical": "4",
    "abstract": "Let's learn how to attack “Modern Desktop” applications. Specifically we will look at the blurring lines between desktop and web applications, and how embedded (browsers) renders can be exploited, the methods for discovering exploits, and how they can be fixed. On this journey we go over remote code execution vulnerabilities I discovered in apps like Teams, Outlook, Facebook Workplace, chat apps like Slack and Google Chat, and even a Docker sandbox escape. I will also be introducing a new IAST (interactive application security testing) tool I developed to help find these issues. Last and most importantly look at how to prevent / fix these issues in your applications."
  },{
    "title": "Let The Right One In",
    "speaker": [{
        "name": "David Boyd",
        "speaker_id": "dboyd",
        "company": "TrustedSec",
        "twitter": "@fir3d0g",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "David Boyd (@fir3d0g) is a Security Consultant with TrustedSec. He is a Christian, husband, and father who also enjoys geek culture, video games, and Mountain Dew. He has worked with a variety of environments including education, military, retail, government, media, law firms, and hospitals, always learning something from each one along the way. He also once found Waldo and Carmen Sandiego."
    }],
    "talk_id": "letmein",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=Tvv7ZUuLaf8",
    "length": "60",
    "technical": "2",
    "abstract": "Charles Dickens is quoted as saying, 'A very little key will open a very heavy door.' Physical penetration testing is often overlooked when it comes time for a company's annual security assessment. Oftentimes, physical is left out for even a full-scope Red Team exercise. I've heard all of the reasons (excuses) why: 'we have guards,' 'we have locks,' 'card reader access,' 'we know it's an issue, just not a priority,' or 'it seems like cheating,' and the list goes on. I am here to discuss why Physical Penetration Testing/Physical Red Teaming is not only beneficial, but also crucial to a company's security well-being. I will review what physical red teaming is, how physical red teaming differs from traditional physical penetration tests, some of the tactics used in bypassing physical security controls, how closely tied physical security is to the overall posture and effectiveness of security training programs and policies, and will give several scenarios in which a physical intrusion opened several more doors (pun intended) during Red Team excursions."
  },{
    "title": "Passwords are dead? Long live WebAuthn!",
    "speaker": [{
        "name": "Alex Lauerman",
        "speaker_id": "alauerman",
        "company": "TrustFoundry",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Alex is a penetration tester based in Overland Park, Kansas. Alex is thankful for being able to spend over 10 years of his life building and breaking applications."
    }, {
        "name": "Matt South",
        "speaker_id": "msouth",
        "company": "TrustFoundry",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Matt is a penetration tester from Kansas City, MO. He specializes in web and mobile application testing, but loves all things security."
    }],
    "talk_id": "webauthn",
    "pdf": "",
    "length": "60",
    "technical": "3",
    "abstract": "Password security is getting out of hand. You only need to watch the latest news stories about large-scale breaches or visit the haveibeenpwned site to see the current state of password security. Expecting end users to invent complex passwords for every web site they visit is untenable. Wouldn't it be great if there was some new technology that uses public key exchange and biometrics to get rid of passwords all together?  Well, that technology is here. WebAuthn (Web Authentication) is a web standard published in 2019 by the World Wide Web Consortium (W3C). The goal of the project is to standardize an interface for authenticating users to web-based applications and services using public-key cryptography instead of passwords. Despite being an emerging technology, this standard has already been adopted by leading browsers and platforms.  This talk aims to shed light the technical details of what WebAuthn is and how it works. We will also cover the security pros and cons of this new standard and make predictions about what this may mean for the future of web application security. This is an introductory talk. You do not need any prior knowledge of web authentication or cryptography to benefit from this talk."
  },{
    "title": "Getting started with OSINT",
    "speaker": [{
        "name": "Jamie Maguire",
        "speaker_id": "jmaguire",
        "company": "High Point Networks",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Jamie Maguire is a Senior Security Engineer at High Point Networks where he focuses on Penetration Testing and Vulnerability Assessment services. Over the past nine years Jamie has held various roles in IT and Security including: Helpdesk Support, Network Administration and Vulnerability Management. To unplug from technology, Jamie enjoys spending time with his dog Frank and reading. Jamie just finished Click Here to Kill Everybody."
    }],
    "talk_id": "osintro",
    "pdf": "K2020_jmaguire.pdf",
    "video": "https://www.youtube.com/watch?v=QgHcvb6D3So",
    "length": "60",
    "technical": "2",
    "abstract": "The first step of a Penetration Test is often called Reconnaissance, Information Gathering or OSINT. During this step, Penetration Testers attempt to gather as much information as they can about a target environment by using publicly available information. Unfortunately, this step may be ignored or not completed thoroughly.  This is intended to be a 101-level presentation in which we discuss how an attacker may conduct reconnaissance against a target, and what specific information they might be interested in gathering. We will cover specific tools including theHarvester, Shodan, Recon-ng and more. This presentation is intended to give Security Professionals and Administrators an understanding of how attackers conduct information gathering against environments. Audience members will see specific examples of tools and techniques that they can apply to their own environments. We will not cover any new or novel techniques, but my goal is to provide the audience with the knowledge to gather meaningful information quickly."
  },{
    "title": "Bio Hack: How Integrative Medicine principles can change the game in Cyber Security",
    "speaker": [{
        "name": "Joseph Wilson",
        "speaker_id": "jwilson",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Joseph Wilson is a computer security expert whose career included five years as the Chief of a major Department of Defense (DoD) Network Operations and Defense Center (NOC) before entering the private sector. He also served as the security architect, strategist, and Manager of Security Operations for a Fortune 250 food company prior to joining CSG International. Joe now serves as the Chief Information Security Officer and is responsible for protecting customer as well as company assets for CSG International 24/7. He lives in Omaha, Nebraska with his wife and three kids."
    }],
    "talk_id": "biohack",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=AVqeYA8-IuE",
    "length": "60",
    "technical": "3",
    "abstract": "Cyber Security is an exceedingly complex space that requires extreme levels of investment in people, processes, and technology to make a large impact on an organization. Despite the investment, we often sit in the 'spin zone' and accept the status quo and lack of progress. However, there are parallels we can draw from other complex fields (in this case healthcare) to help us consider fundamental or alternative methods for solving the complex security issues we face. Join me in understanding the similarities between patient wellness and Cyber Security and the opportunities that lie ahead for us to improve our capabilities."
  },{
    "title": "Breaking barriers: An introvert's story to InfoSec",
    "speaker": [{
        "name": "Ryen Macababbad",
        "speaker_id": "rmacababbad",
        "company": "Microsoft",
        "twitter": "@ryen_mac",
        "github": "",
        "linkedin": "",
        "image": "rmacababbad.jpg",
        "bio": "She/her, Mentor, Army Veteran, Microsoftie, in that order.  https://about.me/ryen_mac"
    }],
    "talk_id": "breakingbarriers",
    "pdf": "K2020_rmacababbad.pdf",
    "video": "https://www.youtube.com/watch?v=U1gye84Txrg",
    "length": "60",
    "technical": "1",
    "abstract": "Barriers can slow us down from reaching our goals but they don’t have to block us. The key is not letting the gates stop you in your tracks and instead finding a way around or through them. This is hard enough without throwing in the introversion and imposter syndrome common to our industry.  Join me while I walk through my journey overcoming the challenges of being an introvert trying to learn while overcoming the imposter syndrome that says I can't. You'll walk away with strategies to create opportunities that will showcase your strengths and ways to overcome the internal monologue that forever tells us we can't."
  },{
    "title": "The Top 10 Tools For Cloud Penetration Testing",
    "speaker": [{
        "name": "Michael Born",
        "speaker_id": "mborn",
        "company": "SecureSky",
        "twitter": "@blu3gl0w13",
        "github": "",
        "linkedin": "https://www.linkedin.com/in/michael-born-89080324/",
        "image": "mborn.jpg",
        "bio": "Michael Born works as a Sr. Security Consultant for SecureSky, Inc. in Omaha, NE. His primary duties include performing various security assessments for on-prem and cloud environments. Michael is the author of Binary Analysis Cookbook from Packt Publishing, participates in the local DC402 group and co-leads the Omaha chapter of OWASP. Michael enjoys hacking, learning new skills, shooting, and particpating in capture the flag events."
    }],
    "talk_id": "top10cloud",
    "pdf": "K2020_mborn.jpg",
    "video": "https://www.youtube.com/watch?v=K8BfA8lzca8",
    "length": "60",
    "technical": "2",
    "abstract": "As organizations move their traditional on-prem environments to the cloud, penetration testing tools and techniques must also adapt. This talk will highlight the top 10 tools every penetration tester should add to their arsenal when performing a penetration assessment against a cloud environment. Tools covered will work against Azure/Office 365, Google Cloud/G Suite, and AWS."
  },{
    "title": "A Red-Teamer's Guide to Building a Blue Team",
    "speaker": [{
        "name": "Mark Bayley",
        "speaker_id": "mbayley",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "mbayley.png",
        "bio": "Mark is the Infrastructure Security Manager at KU Hospital System, responsible for securing over 100+ locations across KS and MO. He is also an adjunct professor at Bellevue University, Liberty University, and MCCKC where he teaches IT Security from the Master's level down to Associate's."
    }],
    "talk_id": "redteamblueteam",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=ifImQaHEhqY",
    "length": "60",
    "technical": "3",
    "abstract": "How blue teamers and red teamers think is fundamentally different. This talk will delve into some of those details from a perspective of appreciating the differences – but it will not focus exclusively on them, as it is geared towards how to build a strong security team in general. Some of the aspects of a good blue team is Incident Response team, tuning a SIEM, solidifying network security and other opportunities for a better overall security posture. It will not focus on KU Health system and our systems/solutions, but instead will involve leadership strategies, technical details, and security posturing areas to consider."
  },{
    "title": "Better Phishing through Smarter Infrastructure",
    "speaker": [{
        "name": "Chris Patten",
        "speaker_id": "cpatten",
        "company": "StackTitan",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Chris Patten does all the same, but not as well as Dan."
    }, {
        "name": "Dan Kottmann",
        "speaker_id": "dkottmann",
        "company": "StackTitan",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Dan Kottmann is a wrangler of bits, co-founder of Stacktitan, co-author of Black Hat Go, and roots for the team of red."
    }],
    "talk_id": "betterphishing",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=E8KaQ7UL1L0",
    "length": "60",
    "technical": "3",
    "abstract": "These days, everyone is looking for the phish that is either a generic drive-by or a more targeted campaign, such as a weaponized ransomware attack. Blue teams are smarter, instrumentation is smarter, and detection capabilities have advanced; especially in enterprise networks.  Further, set aside all of the click-through/pre-manufactured commodity phishing security awareness services for a moment. The real question, what happens when adversaries aren’t so brazen with their tactics and take smarter steps to counter detection?  Pre-emptive strike campaigns that are both innocuous (almost forgettable) to glean target details before the real attack, the correct tooling to prevent prying defenders from reaching the command and control redirectors or malware servers, blacklists and whitelists, domain registration misdirection, and quite possibly peering into the void of the vast amounts of signal-to-noise honeypot data trawling the Internet while using it to become more situationally aware.  The operators at STACKTITAN will discuss all of these topics and how proprietary tooling has helped shift their perspective on effective phishing techniques. Additionally, REAL mitigation techniques will be discussed to better prepare organizations to defend against these attack campaigns. In conclusion, the presentation will be informative with plenty of opportunity for collaborative discussion."
  },{
    "title": "Kernelcon2020 Badge: nonononoyes",
    "speaker": [{
        "name": "Tyler Rosonke",
        "speaker_id": "trosonke",
        "company": "",
        "twitter": "@zonksec",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Tyler is a security professional based in Omaha, Nebraska. His main area of focus is in penetration testing. He loves learning and scripting his way out of a tight spot, which makes this area of security right up his alley. Tyler graduated from the University of Nebraska at Omaha with a B.S. in Information Assurance in 2014 and has been working in the offensive security roles ever since. Tyler is highly involved with the security community. He has contributed to open source projects, he has spoken at security conferences (DefCon), and he writes/operates the ZonkSec security blog. If Tyler is not banging his head against his monitor, you’ll likely find him in a garage banging his head against a vintage 2-stroke moped or wandering around in the great outdoors."
    }, {
        "name": "Aaron Gunning",
        "speaker_id": "agunning",
        "company": "",
        "twitter": "@scotchsec",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Aaron is an amateur hardware hacker and a professional security analyst. At hacker cons in meat-space, he is usually found in a hardware hacking village or the bar.  Sometimes both at the same time. Antics and sarcasm can be found on the interwebs @Scotchsec."
    }],
    "talk_id": "nonononoyes",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=VYY81450_RM",
    "length": "60",
    "technical": "3",
    "abstract": "Ever been curious about how electronic badges, or printed circuit boards (PCB) in general, get made? Come ride along with this year's Kernelcon badge makers, @zonksec and @scotchsec, as they explain the rollercoaster of turning the Hack-Master badge idea into a reality!"
  },{
    "title": "Hacking your Cybersecurity Career",
    "speaker": [{
        "name": "Ron Woerner",
        "speaker_id": "rwoerner",
        "company": "",
        "twitter": "@ronw123",
        "github": "",
        "linkedin": "https://www.linkedin.com/in/ronwoerner/",
        "image": "rwoerner.jpg",
        "bio": "Ron Woerner, CISSP, CISM is a noted consultant, speaker and writer in the Security industry. As the Cyber-AAA Chief Security Evangelist, he delivers assessments, awareness and answers to small, medium, and large organizations. Ron established the Cybersecurity Studies program at Bellevue University, an NSA Center of Academic Excellence where he still teaches. He has been a featured speaker at the TEDx, (ISC)2, ISACA, and RSA conferences. Ron is always looking for more hackers."
    }],
    "talk_id": "careerhack",
    "pdf": "K2020_rwoerner.pdf",
    "video": "https://www.youtube.com/watch?v=0M5SHUT5VAQ",
    "length": "20",
    "technical": "1",
    "abstract": "'How do I find a job in cybersecurity?' This is an issue for both new and experienced professionals. There continues to be a disconnect between those hiring and those looking.  This session explains solutions to overcome the cybersecurity hiring gap. Whether attendees are looking to break into cybersecurity or land their next job, they can use hacker skills to make it happen. In this session, I’ll explain three traits of a well-rounded cybersecurity professional, three areas for balanced learning, and steps for hacking your career including visualizing your goals, knowing the best path for you, social engineering your next boss, active learning and keeping your skills sharp. This session also presents the difference cybersecurity career paths based on the NIST National Initiative for Cybersecurity Education (NICE). To get the right job, use hacking techniques to break through the hiring process.  Learn how here."
  },{
    "title": "A Hacker’s Viewpoint: Planning the Attack",
    "speaker": [{
        "name": "Robert George",
        "speaker_id": "rgeorge",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Robert George is the Principle CyberSecurity Architect for Sentara Healthcare. He has worked in the security field for 10 years as an analyst, engineer, architect, and SOC manager. He is currently working towards a MBA and holds a leadership position with the health system. In his spare time, he plays the violin and researches new technologies."
    },{
        "name": "Kristina Krasnolobova",
        "speaker_id": "kkrasnolobova",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Kristina Krasnolobova is Data Security Analyst for Sentara Healthcare. She managed to collect couple MS degrees and now working on filling up her tool belt with certifications, enjoys volunteer and believes in giving back to community. Her spare time she spends outdoors."
    }],
    "talk_id": "hackerviewpoint",
    "pdf": "K2020_rgeorge.pdf",
    "length": "20",
    "technical": "3",
    "abstract": "A lot of work has gone into breaking out the stages of an attack. Unfortunately, many security teams focus on the detection of infiltration, data loss, or response after an attack. This focus skips over a more proactive approach to preventing the attack during the planning stages. There is a plethora of information publically available about a company and its employees that is collected prior to an attack. This information is used to find vulnerabilities in information systems. The information is also used to plan out social engineering which is used to gain system credentials or additional information about a company."
  },{
    "title": "Bash Bunny Basics",
    "speaker": [{
        "name": "Anthony Bernard",
        "speaker_id": "abernard",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "I am a young 13 year old. I am a student at Riverside Jr. High in 8th grade, a hacker, and a small human."
    }],
    "talk_id": "bunny",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=YQT2hTQzmOU",
    "length": "20",
    "technical": "1",
    "abstract": "Ever wanted to steal passwords and run other programs in seconds with only a small USB sized tool? No? Well, now you can! The Bash Bunny will allow you to program keystroke attacks, which then are executed at lightning speed once you plug it in. In this talk you will learn the basics of this device and a few programs."
  },{
    "title": "A Secure Design and Implementation of a Smart Home",
    "speaker": [{
        "name": "Owen Parkins",
        "speaker_id": "oparkins",
        "company": "",
        "twitter": "@nopesled",
        "github": "",
        "linkedin": "",
        "image": "oparkins.png",
        "bio": "Owen Parkins is a graduate student at New Mexico Institute of Mining and Technology. He will be graduating in May with his Master's degree in Computer Science with a focus in Cybersecurity. His primary skill set includes system administration, vulnerability analysis, and exploit development."
    }],
    "talk_id": "smarthome",
    "pdf": "K2020_oparkins.pdf",
    "length": "20",
    "technical": "2",
    "abstract": "Smart homes can be a highly contested cybersecurity topic. Some professionals are fearful of the technology that can be too close to home - and for good reason. With the current political climate regarding foreign made devices, many devices are not safe to have in the home. This should not stop professionals from gaining more experience with a rapidly expanding technology and figuring out a way to use it effectively. This talk describes a design and implementation of a secure smart home."
  },{
    "title": "Astrophotography - Backyard Robotics for Art and Science",
    "speaker":[{
        "name": "Seth Eddy",
        "speaker_id": "seddy",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Seth is a member of the amateur astronomy club for the Monterey Institute for Research in Astronomy and a contractor in central California."
    }],
    "talk_id": "astrowhat",
    "pdf": "",
    "length": "20",
    "technical": "1",
    "abstract": "This talk will be an introduction into of amateur robotic astronomy for imaging and science and will discuss the challenges and solutions for building robotic telescopes."
  },{
    "title": "Unleash your Camera with CHDK",
    "speaker": [{
        "name": "Aaron Grothe",
        "speaker_id": "agrothe",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Aaron Grothe has been a Linux Admin, Security Admin, and a software developer.  He has won the IOCCC twice, is a Linux Kernel contributor, has been published in 2600 magazine and has been a Board Member with NEbraskaCERT for the last 10 years. He holds a variety of certifications: CISSP, Security+, CySA+, Pentest+, and many others."
    }],
    "talk_id": "chdk",
    "pdf": "",
    "length": "60",
    "technical": "3",
    "abstract": "Cannon Hack Development (CHDK) was initially created to allow features in Canon Cameras such as RAW image output to be available on cameras that came without them.  Since then additional features have been added to CHDK that have made it more useful to many people.  Some of these features are: scripting, high speed photography, 3d pictures, live histograms and many more.  This talk will cover all the steps needed to create an SD card with the CHDK software and show some of the features that makes available.  We'll also talk about some of the other free firmwares available such as 400plus, Spy Lantern and Magic Lantern."
  },{
    "title": "Anybody wanna launch some missiles?",
    "speaker": [{
        "name": "Dan Tentler",
        "speaker_id": "dtentler",
        "company": "Phobos",
        "twitter": "@viss",
        "github": "",
        "linkedin": "",
        "image": "dtentler.jpg",
        "bio": "Dan Tentler is the Executive Founder of Phobos Group. He's got a long history of both attack and defense roles, as well as public speaking engagements and press interviews. Dan has made a name for himself and Phobos Group by approaching security from an entirely different new direction, yielding in routine discoveries which have major impact on customers as well as the greater security landscape."
    }],
    "talk_id": "missiles",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=b-ydD5emKnw",
    "length": "60",
    "technical": "3",
    "abstract": "The computer security industry several huge problems. These problems routinely coagulate together to from 'digital binary explosives' - naturally, in the wild. We can use these to gain access to places we shouldn't be able to reach. Imagine being able to have access to every spy satellite at once. How many barriers could you see past? What could you assert about a place? Could digital binary explosives get you past any of those barriers? It's broadly known just how ineffective the security industry is right now - but we're all happy living in denial about it. The security posture of large companies who were recently breached and did huge public DFIR campaigns are great examples, and live demos are even better examples - we're doing both. Live, on-stage, we'll discover some companies who have not yet been breached, but are candidates for a breach based on their security posture, and we'll cover how the current 'curriculum' of  'how to get a job in infosec' is partially to blame."
  },{
    "title": "KetoAppSec: It’s All about the FATS",
    "speaker": [{
        "name": "David Lindner",
        "speaker_id": "dlinder",
        "company": "Contrast Security",
        "twitter": "@golfhackerdave",
        "github": "",
        "linkedin": "",
        "image": "dlindner.jpg",
        "bio": "David Lindner is the Director of Application Security at Contrast Security. As an experienced application security professional with over 18 years of experience in the computer security industry, Lindner has worked within multiple disciplines in the security field, from application development, network architecture design and support, IT security and consulting, security training and application security. Over the past 10 years, he has specialized in all things related to mobile applications and securing them. Lindner has supported many different clients including financial, government, automobile, healthcare and retail. In his spare time, he hones his mobile and IoT testing skills by participating in numerous bug bounties."
    }],
    "talk_id": "keto",
    "pdf": "K2020_dlindner.pdf",
    "video": "https://www.youtube.com/watch?v=MSA9ZmBu1-s",
    "length": "60",
    "technical": "3",
    "abstract": "The Ketogenic diet has taken form over the past few years and it actually works. So how can we apply something similar to our application security practices? Application security traditionally focuses on tools or manual testing. We traditionally do “static (SAST)” or “dynamic (DAST)” tool assessments and label them as a “full” or “time-boxed” assessment. The driving force is usually budget or lack thereof, so how do we trim down our assessment methodologies yet be efficient, precise and beneficial? There are many ways to be more efficient in the way we AppSec to get the most benefit out of the time we have. Whether it be making risk-based decisions, looking for patterns, understanding frameworks and their built-in protections, we can make intelligent choices and guesses. David Lindner will walk through some tips and tricks that will help consultants and internal testers alike focus on the fat of applications in a shortened timeframe."
  },{
    "title": "How to Pave a Path Forward for InfoSec by Hacking Hearts and Minds",
    "speaker": [{
        "name": "Chad Calease",
        "speaker_id": "ccalease",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Parent, partner, ludic, neurodivergent, grateful for many gifts. Mom said, 'There's always one weirdo on every bus.' But I can never find them"
    }],
    "talk_id": "pave",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=B556fz2Ku-s",
    "length": "60",
    "technical": "1",
    "abstract": "Messages transmitted about privacy and security over the past 200 years or so haven’t always been very friendly or accessible and many are in direct contrast to today’s definitions, expectations, and requirements. We’ll take a fast but memorable stroll through history to illuminate a new path forward lit by some quick-win hacks to address these cultural challenges and elevate our understanding of, interest in, and ability to hack how our families, friends, colleagues, clients, and - potentially - how the world-at-large thinks about, understands, and values privacy and information security."
  }, {
    "title": "Pirate Radio: Riding the Ragged Edges",
    "speaker": [{
        "name": "Michael Tomasiewicz",
        "speaker_id": "mikeyt",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Michael is a Lead Cyber Engineer for the Omaha Public Power District.  He is usually refered to as 'Mikey T', as Tomasiewicz is wholly unpronounceable. Mikey T is not s0pr1337hx0r, but considered in some circles to be an idiot savant, sans that pesky savant part.  Regardless, he is an accomplished and entertaining speaker.  In his spare time you will find him either reading, taking something apart, or loudly cursing a scuffed up 1.68\" dimpled projectile."
    }], 
    "talk_id": "pirate",
    "pdf": "",
    "video": "https://www.youtube.com/watch?v=URrdJtjZ_24",
    "length": "20",
    "technical": "2",
    "abstract": "For the hobbyist, radio is technically fascinating.  For the uninitiated, black-magical.  What they both have in common? The FCC will be happy to fine the S#!& out of you if you violate the law regarding illegal uses of reserved bands, particularly commercial FM frequencies.  We'll talk about why \"pirates\" pirate on FM, affordable gear options, and how to experiment with the technology without being fined back to the stoneage."
  }, {
    "title": "WannaWorm",
    "speaker": [{
        "name": "Michael Kunz",
        "speaker_id": "kunz",
        "company": "",
        "twitter": "",
        "github": "",
        "linkedin": "",
        "image": "",
        "bio": "Michael is a University of Nebraska at Omaha Alumni. He co-founded UNO's capture the flag team, Nullify, and has been working in the government sector for 6 years."
    }], 
    "talk_id": "worm",
    "pdf": "",
    "length": "20",
    "technical": "5",
    "abstract": "Ever wonder how to build a worm?  Mike will demonstrate how to build a ghetto worm using wanna cry.  He's also going to talking about some of his work with large scale emulation using the government funded Open Source tool Minimega.  Combining the two, he'll use Minimega to run the worm."
  }
]









