[
 {
    "title": "The Beginner’s Guide to Pentesting ICS:  How NOT to Shut Down A Power Grid",
    "speaker": "Dan Bougere",
    "talk_id": "introics",
    "speaker_id": "dbougere",
    "company": "",
    "twitter": "@Rouxgaru",
    "github": "",
    "linkedin": "danbougere",
    "image": "dbougere.jpg",
    "pdf": "",
    "length": "60",
    "technical": "2",
    "bio": "Dan Bougere is a Principal Cybersecurity Consultant at Revolutionary Security, LLC. Dan has over 17 years of combined experience in both government and commercial sectors as a contractor for the Department of Defense, an analyst in the National Security Agency's TAO office, and other roles with intelligence community partners, business, utilities, and local governments.  Dan earned a BS degree in Software Engineering Technology from the University of Southern Mississippi, a MS degree in Information Assurance from Capitol Technology University, and a MS degree in Technology Studies from Eastern Michigan University. Dan holds multiple certifications from SANS, CompTIA, ISC2, and ISACA.",
    "abstract": "Learn what exactly is SCADA/ICS, why it's important, how horrifyingly ancient it all still is, and how to pentest it without kicking over generators or flooding toxic gases everywhere! If you want to hear jaw dropping stories, lose sleep over chemical plants on your commute, or find that nice job niche that's hiring everywhere now is your chance."
  },{
    "title": "Zero to Hero",
    "speaker": "Christopher Wright",
    "talk_id": "zhero",
    "speaker_id": "cwright",
    "company": "Infogressive",
    "twitter": "",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "20",
    "technical": "1",
    "bio": "Husband, Father, Homebrewer, Ham, Hacker.",
    "abstract": "Having to start over again after being fired from a 5-year job, I saw the trend of hacks and saw that cybersecurity was going to be a low unemployment industry. I went back to college and started this new career path at the age of 34. This presentation will showcase the path I have made going from graduating college with a BSIT degree and zero industry experience to getting a SoC analyst job to becoming a project engineer inside of 1 year from date of hire."
  },{
    "title": "Protecting your Small or Medium Business from Cyber Attacks",
    "speaker": "Jeff Struik",
    "talk_id": "smb",
    "speaker_id": "jstruik",
    "company": "Cyber Strike Solutions",
    "twitter": "",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "60",
    "technical": "2",
    "bio": "Jeff is an experienced cyber security expert with a strong background in the defense industry. He has his Doctor of Computer Science with a Cyber Security concentration, as well has his CISSP, PenTest+, and Network+. Jeff has a passion for the security of embedded systems and a love of sharing knowledge for the betterment of the security community.",
    "abstract": "Small and Medium businesses are prime targets for malicious actors. Lacking the budgetary freedom that larger businesses may have for cyber security and limited personnel resources presents a large bullseye on many small and medium business. This talk addresses various free or built-in options for an organization to use to protect their systems from cyber attacks and reduce their attackable surface."
  },{
    "title": "Adventures in Creating a Cybersecurity Dataset",
    "speaker": "Heather Lawrence",
    "talk_id": "cyberdata",
    "speaker_id": "hlawrence",
    "company": "",
    "twitter": "",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "60",
    "technical": "2",
    "bio": "Heather Lawrence is a data scientist for the Nebraska Applied Research Institute who earned her undergraduate and masters degrees in Computer Engineering from the University of Central Florida. In previous lives she was a USN nuke, VA photographer, NCCDC winner, Hack@UCF mom, and darknet marketplace miner. Her current research centers on the application of machine learning to intrusion detection. She serves the community through volunteer work for Kernelcon and DEF CON as well as facilitating logistics as a member of the VetSec and B-Sides Orlando boards.",
    "abstract": "While the foray to apply machine learning to information security is new, there remain challenges to creating and accessing datasets that are beneficial to security research. This talk is going to discuss our journey in creating an open-source network security dataset, the community-accepted guidelines to creating good data, and the challenges we faced. Moreover, this talk examines the gap between academic datasets and data released by the professional community before providing resources to new datasets that have been released in neighboring areas."
  },{
    "title": "Adventures with McAfee:  Powering down McAfee ePO at Cboe Global Markets",
    "speaker": "W. S. Cheng",
    "talk_id": "epo",
    "speaker_id": "wscheng",
    "company": "",
    "twitter": "",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "20",
    "technical": "3",
    "bio": "I am currently employed at Cboe Global Markets as an Information Security Specialist. I am interested in all facets of computer engineering, and I am especially drawn to enterprise system architecture, complex system management, and network security.",
    "abstract": "When CBOE (Chicago Board Options Exchange) acquired Bats Global Markets, senior management decided to move forward with Bats technology.  The plan was straightforward:  Decommission legacy CBOE systems.  However, 40+ years of knowledge hoarding and 40+ years without documentation, Cboe's security operations turned to me.  I was then tasked with turning this off."
  },{
    "title": "Building a Vulnerability Management Program - Avoiding Pitfalls, Managing Risk, and Mastering CYA",
    "speaker": "Megan Benoit",
    "talk_id": "cya",
    "speaker_id": "mbenoit",
    "company": "",
    "twitter": "",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "60",
    "technical": "3",
    "bio": "Megan Benoit has spent most of the last 20 years building vulnerability management and incident response programs, architecting and deploying security solutions, and asking people if they’ve tried turning it off and on again. Megan currently works as a Senior Network Security Engineer and has worked for the DoD, healthcare, and retail industries. Her hobbies include chasing pokemon, denying firewall change requests, and yoga, recently completing a 200 hour yoga teacher training course.",
    "abstract": "Building a vulnerability management program often feels like eating an elephant that’s guarded by sharks — every time you try to take a bite, you’re dodging someone that’s trying to take a bite out of you. I am going to walk you through building an effective vulnerability management program: avoiding and mitigating common problems, navigating the organizational waters, and getting the most bang for your buck when it comes to reducing your risk. Vulnerability management is more than just running a scan and putting in tickets for remediation — it’s about managing the people involved in the scanning and remediation processes and finding a middle ground that reduces your risk and makes operations happy."
  },{
    "title": "The DIY Artificial Pancreas: Hacking Wetware with Open Source Software and Hardware",
    "speaker": "Jay Lagorio",
    "talk_id": "diypancreas",
    "speaker_id": "jlagorio",
    "company": "",
    "twitter": "@jaylagorio",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "60",
    "technical": "3",
    "bio": "Jay Lagorio, software engineer and independent security researcher, has been building computers and networks and writing code nearly his entire life. He received a B.S. in Computer Science from UMBC in 2008 and an M. Eng. from the Naval Postgraduate School in 2015. He's a Private Investigator in Washington, DC and specializes in Windows development and OSINT.",
    "abstract": "Technology to manage diabetes revolves around stagnated tech from the 80s and 90s. Hackers took their lives into their own hands by developing open source hardware and software to augment inadequate products. Developing and building a DIY artificial pancreas, its iterations, and real-life examples of will be discussed and at least one will be working on the presenter. Taking the human out of the loop and replacing them with technology increases quality of life. See what happens when hackers decide they’re not waiting around for government and the MedTech industry to do better.  Managing diabetes revolves around stagnated tech from the 80s and 90s. Hackers took their lives into their hands by augmenting inadequate products after market. Building iterations of a DIY artificial pancreas and real-life examples of will be discussed and at least one will be working on the presenter. Replacing human intervention with technology betters quality of life. See what happens when hackers decide they’re not waiting around for government and the MedTech industry to do better."
  },{
    "title": "Attacking Secondary Contexts in Web Applications",
    "speaker": "Sam Curry",
    "talk_id": "webcontext",
    "speaker_id": "scurry",
    "company": "",
    "twitter": "samwcyo",
    "github": "",
    "linkedin": "",
    "image": "scurry.png",
    "pdf": "",
    "length": "60",
    "technical": "3",
    "bio": "Sam Curry is a full time bug bounty hunter and security consultant through 17security, LLC. He has been active in the security community since 2015 and runs a blog dedicated to advancing web application security research at samcurry.net.",
    "abstract": "This talk explores attacking various 'secondary contexts' in web applications where data is being passed to an underlying internal HTTP server.  We will explore the different approaches to targeting limited-access/internal APIs, the very strange interactions between different servers within the stack, and lastly the different types of vulnerabilities present in second stage HTTP services."
  },{
    "title": "Key Duplication - It's not just for the movies!",
    "speaker": "Tony Virelli",
    "talk_id": "keydup",
    "speaker_id": "tvirelli",
    "company": "",
    "twitter": "@virelli",
    "github": "",
    "linkedin": "",
    "image": "tvirelli.jpg",
    "pdf": "",
    "length": "60",
    "technical": "2",
    "bio": "Tony is a full time web developer with a love of locksport and physical pen testing. He is a member of TOOOL in Des Monies, Iowa. He is a proud father and lucky husband.",
    "abstract": "Have you ever seen someone just walking around with a key hanging on thier belt? How about a wall of keys behind a security desk? Better yet, has anyone you know every posted a picture of the keys to the new home they just bought? Well, what if you could take a picture and easily duplicate that key with a 3D Printer? Sound like something from a James Bond film? Well it's not! Better yet, if you can just get a moment alone with a key, you can get an imprint of it in less than 2 minutes, return the key to the owner and then cast a duplicate of that key for later use."
  },{
    "title": "Dispelling myths of red/blue cyber competition through metrics",
    "speaker": "Kandy Phan",
    "talk_id": "redbluemetrics",
    "speaker_id": "kphan",
    "company": "Sandia",
    "twitter": "",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "20",
    "technical": "1",
    "bio": "Kandy is a cybersecurity researcher and red team lead.",
    "abstract": "The DOE CyberForce Competition is an annual college event where student defenders compete against each other, defending their systems from red teams. The goal of this competition is to improve the technical skill sets of the students to prepare them for the work force. However, just randomly throwing red and blue teams together hoping that magic will happen is a recipe for disaster. But it’s hard to correct deep-seated wrong views about these cyber competitions.  So this year, at the Albuquerque site, we developed a process and automated tooling to collect data during the competition to answer questions such as the average number of vulnerabilities patched before game start time, ability for lateral movement without initial access, detection rate of more advanced C2, etc.  This data is really important for us to get insights about the competition so that we can improve it for the students. Hopefully, more competitions will start collecting these types of metrics so that we can improve the state of cyber education events."
  },{
    "title": "How Ghidra changed my life",
    "speaker": "Chris Eagle",
    "talk_id": "ghidra4life",
    "speaker_id": "ceagle",
    "company": "",
    "twitter": "@sk3wl",
    "github": "",
    "linkedin": "",
    "image": "ceagle.jpg",
    "pdf": "",
    "length": "60",
    "technical": "4",
    "bio": "Chris Eagle is a security researcher whose interests include computer network operations, computer forensics and reverse/anti-reverse engineering. He was the chief architect of the competition infrastructure for DARPA's Cyber Grand Challenge. He has been a speaker at conferences such as Kernelcon, Blackhat, and Defcon and is the author of 'The IDA Pro Book'. In his spare time he is an inveterate CTF player and has twice won the prestigious capture the flag competition at Defcon.",
    "abstract": "Anyone that knows me also knows that I'm a huge IDA Pro fanboy. Ghidra, the NSA's answer to IDA, has been in the public's hands for about a year now, so where does that leave me?  Still solidly in the IDA camp, but that doesn't mean that Ghidra hasn't had an impact on my life. Thanks to the magic of open source we can take one of Ghidra's nicest features and bolt it onto IDA to fill some gaps in IDA coverage. In this talk, I'll introduce the 'Binary Lifting Component' (it's kinder name), or just blc for short, plugin for IDA.  blc takes the core of Ghidra's decompiler capability and builds an IDA plugin around it to add decompilation capability to IDA for all processors supported by Ghidra."
  },{
    "title": "Exploiting Modern Desktop Applications",
    "speaker": "Matt Austin",
    "talk_id": "exploitdesktop",
    "speaker_id": "maustin",
    "company": "",
    "twitter": "@mattaustin",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "60",
    "technical": "4",
    "bio": "Matt Austin is a security researcher and bug bounty hunter with 15 years of appsec experience. He is also the Director of Security Research at Contrast Security focused on runtime security assessment and protection through instrumentation.",
    "abstract": "Let's learn how to attack “Modern Desktop” applications. Specifically we will look at the blurring lines between desktop and web applications, and how embedded (browsers) renders can be exploited, the methods for discovering exploits, and how they can be fixed. On this journey we go over remote code execution vulnerabilities I discovered in apps like Teams, Outlook, Facebook Workplace, chat apps like Slack and Google Chat, and even a Docker sandbox escape. I will also be introducing a new IAST (interactive application security testing) tool I developed to help find these issues. Last and most importantly look at how to prevent / fix these issues in your applications."
  },{
    "title": "Let The Right One In",
    "speaker": "David Boyd",
    "talk_id": "letmein",
    "speaker_id": "dboyd",
    "company": "TrustedSec",
    "twitter": "@fir3d0g",
    "github": "",
    "linkedin": "",
    "image": "",
    "pdf": "",
    "length": "60",
    "technical": "2",
    "bio": "David Boyd (@fir3d0g) is a Security Consultant with TrustedSec. He is a Christian, husband, and father who also enjoys geek culture, video games, and Mountain Dew. He has worked with a variety of environments including education, military, retail, government, media, law firms, and hospitals, always learning something from each one along the way. He also once found Waldo and Carmen Sandiego.",
    "abstract": "Charles Dickens is quoted as saying, 'A very little key will open a very heavy door.' Physical penetration testing is often overlooked when it comes time for a company's annual security assessment. Oftentimes, physical is left out for even a full-scope Red Team exercise. I've heard all of the reasons (excuses) why: 'we have guards,' 'we have locks,' 'card reader access,' 'we know it's an issue, just not a priority,' or 'it seems like cheating,' and the list goes on. I am here to discuss why Physical Penetration Testing/Physical Red Teaming is not only beneficial, but also crucial to a company's security well-being. I will review what physical red teaming is, how physical red teaming differs from traditional physical penetration tests, some of the tactics used in bypassing physical security controls, how closely tied physical security is to the overall posture and effectiveness of security training programs and policies, and will give several scenarios in which a physical intrusion opened several more doors (pun intended) during Red Team excursions."
  }
]
