[
	{
		"title": "Radio Hacking 101 with RTL-SDR",
                "id": "rtlsdr",
		"hidden": false,
		"instructor": [{
			"name": "Gus Gorman",
			"twitter": "",
			"bio": "Gus Gorman, BS in Bioinformatics from UNO. Local greyhat hacker & maker, with a passion for wireless & embedded tech. Speaker at KernelCon 2019 (Radio Hacking 101)"
		}],
		"courseLength": 2,
		"dates": [{
			"day": "Friday, March 27th",
			"time": "10:00 AM"
		}, {
			"day": "Saturday, March 28th",
			"time": "12:30 PM"
		}],
		"minStudents": 10,
		"maxStudents": 30,
		"cost": 50,
		"trainingDescription": "Every security professional, from locksmiths to blue teams, should have an inexpensive RTL-SDR in their toolkit. Radio signals are everywhere, and many of them rely on obsolete or proprietary formats that are easy to intercept & analyze. Learn to catch & exploit these signals in this workshop; Using Linux & open source tools, you’ll learn to hack the airwaves. Take home a RTL-SDR.",
		"prereqs": [{
			"req": "Beginner experience with Linux command line (e.g. changing directories, listing files)."
		}, {
			"req": "Students need a laptop that can utilize a Linux OS environment (not a Virtual Machine)"
		}, {
			"req": "Optionally, bring your own Raspi (3 or older, w is fine) with power and SD card, to complete a few additional acitivities."
		}],
		"equipment": [{
			"req": "If attendees don't have Linux, bootable Kali USB sticks will be available for purchase (~$10; all software will be pre-loaded on stick)."
		}, {
			"req": "Some Raspi+power+sd card kits will be available for purchase on site."
		}],
		"takeHome": [{
			"req": "RTL-SDR dongle and antenna kit."
		}]
	}, 
	{
		"title": "Introduction to Hardware Hacking and IoT: Lightstrip Edition",
                "id": "iotlights",
		"hidden": false,
		"instructor": [{
			"name": "Matt Virus",
			"twitter": "@themattvirus",
			"bio": "Matt Virus (yes, real name) is an engineer @ Cisco (10+ years) , an above-average husband and father of 2, a farmer, a fan of loud angry rock music, and a hardware junkie with tons of experience with build/hack projects. Whatever “it” is — it can be disassembled and examined…it can be made more secure, more functional and more use useful. No fear of burned fingers, desks set on fire, or escape of the magic smoke here. BS/MS in MIS and information assurance, former DoD forensic and malware analyst, firm believer of local control and auditability of software/firmware. Lover of all things containerized and API-enabled, blackbelt in google-fu, passionate about facilitation, enablement, and helping people reach beyond their technical comfort zone. Founder of hackspace.io, Fueled by monster energy…"
		}, {
			"name": "Jay Keres",
			"twitter": "",
			"bio": "Jay Keres (a.k.a. jtodamfk) is a father extraordinaire to 3 advanced humans. Jay is a crazy individual from around the way. Since he was a youth he let the factory smoke out. He is driven by coolness and surrounded by creativity. His Mom taught him to crotchet, knit, macramé, and generally use Buddha powers of happiness. Since then he is self taught starting in ’87 and a Mainframe operator and doing everything from structured wiring to linux system administration. He was a proud straight ‘D’ student in high school and CCIE #5067."
		}],
		"courseLength": 2,
		"dates": [{
			"day": "Friday, March 27th",
			"time": "12:30 PM"
		}, {
			"day": "Friday, March 27th",
			"time": "3:00 PM"
		}],
		"minStudents": 10,
		"maxStudents": 30,
		"cost": 50,
		"trainingDescription": "In this hands-on hacking village, users will be walked through creating a custom, fully open-source LED-strip controller. All software functions with 100% local control – no beaconing to external “cloud” services. A fully-functional android/iphone app provides interface/control to the created LED-controller via local wifi without external connectivity. An open API provides a web interface as well as simple integration into many home automation and alarm systems.",
		"prereqs": [{
			"req": "A patient desire to be awesome and do cool stuff."
		}],
		"equipment": [{
			"req": "All materials will be provided: soldering iron, supplies, laptop/programming tools all provided."
		}],
		"takeHome": [{
			"req": "A custom, fully open-source LED-strip controller."
		}]
	}, 
	{
		"title": "Introduction to Hardware Hacking and IoT: Smartplug Edition",
                "id": "iotplugs",
		"hidden": false,
		"instructor": [{
			"name": "Matt Virus",
			"twitter": "@themattvirus",
			"bio": "Matt Virus (yes, real name) is an engineer @ Cisco (10+ years) , an above-average husband and father of 2, a farmer, a fan of loud angry rock music, and a hardware junkie with tons of experience with build/hack projects. Whatever “it” is — it can be disassembled and examined…it can be made more secure, more functional and more use useful. No fear of burned fingers, desks set on fire, or escape of the magic smoke here. BS/MS in MIS and information assurance, former DoD forensic and malware analyst, firm believer of local control and auditability of software/firmware. Lover of all things containerized and API-enabled, blackbelt in google-fu, passionate about facilitation, enablement, and helping people reach beyond their technical comfort zone. Founder of hackspace.io, Fueled by monster energy…"
		}, {
			"name": "Jay Keres",
			"twitter": "",
			"bio": "Jay Keres (a.k.a. jtodamfk) is a father extraordinaire to 3 advanced humans. Jay is a crazy individual from around the way. Since he was a youth he let the factory smoke out. He is driven by coolness and surrounded by creativity. His Mom taught him to crotchet, knit, macramé, and generally use Buddha powers of happiness. Since then he is self taught starting in ’87 and a Mainframe operator and doing everything from structured wiring to linux system administration. He was a proud straight ‘D’ student in high school and CCIE #5067."
		}],
		"courseLength": 2,
		"dates": [{
			"day": "Saturday, March 28th",
			"time": "10:00 AM"
		}, {
			"day": "Saturday, March 28th",
			"time": "12:30 PM"
		}],
		"minStudents": 10,
		"maxStudents": 30,
		"cost": 50,
		"trainingDescription": "In this hands-on hacking village, users will be walked through modifying a (minimally) functional smart-home outlet plug. In its default state, the smart plug runs feature- limited, insecure firmware and software that depends on cloud connections and, in most cases, beacons to an external address in China. We will replace the software with open- source pieces and configure the plug to run with 100% local-only, non-cloud, control. Users will also be shown how to connect the newly-converted plug into a home- automation platform for software control via MQTT which enables web-based control, voice-based control, and control of state by a physical button.",
		"prereqs": [{
			"req": "A patient desire to be awesome and do cool stuff."
		}],
		"equipment": [{
			"req": "All materials will be provided: soldering iron, supplies, laptop/programming tools all provided."
		}],
		"takeHome": [{
			"req": "A custom Smart-home Outlet Plug."
		}]
	}, 
	{
		"title": "Making Light Work of Data Exfiltration",
                "id": "lightexfil",
		"hidden": false,
		"instructor": [{
			"name": "Riley Hester",
			"twitter": "",
			"bio": "Riley Hester is a Cyber Engineer for Nebraska Applied Research Institute (NARI) specializing in reverse engineering and developing embedded device firmware. Riley’s genuine enthusiasm for cybersecurity and firmware analysis has driven his research of biomedical devices for life-critical systems. He earned his B.S. in Computer Engineering at the University of Nebraska at Omaha (UNO) where he studied the design and development of embedded microcontroller systems. Riley is currently focused on engaging in the emerging cybersecurity trends and threats that face embedded systems both new and old."
		}, {
			"name": "Eric Wright",
			"twitter": "",
			"bio": "Eric Wright is a Senior Software Engineer for the Nebraska Applied Research Institute (NARI) with a focus on developing embedded device firmware and stand-alone applications. Prior to working for NARI, Eric specialized in communications security for the Army which evolved into an automation engineer for online marketplaces and payment processors. He leverages 20+ years of experience as a full stack security researcher and strives to make a positive impact on security."
		}, {
			"name": "Ian Trent",
			"twitter": "",
			"bio": "Ian Trent is a Cyber Engineer for Nebraska Applied Research Institute (NARI) with a primary focus on critical systems firmware development and reverse engineering. He comes from a self-taught background that focused on game console repurposing and Linux kernel hacking in the swamps of Florida. Ian brings a cloud of enthusiasm for wild ideas related to pen testing and hardening systems. He applies core principals of minimalism and privilege separation favoring mitigations such as canaries, ASLR, no-validation decryption, and poison pages; while primarily leveraging MIM, bytecode injection, and transmission mangling in exploitation."
		}],
		"courseLength": 2,
		"dates": [{
			"day": "Friday, March 27th",
			"time": "10:00 AM"
		}, {
			"day": "Saturday, March 28th",
			"time": "10:00 AM"
		}],
		"minStudents": 10,
		"maxStudents": 30,
		"cost": 50,
		"trainingDescription": "Attendees will learn how to create a light-based data exfiltration receiver based on the esp32 to circumvent corporate firewalls via vulnerable smart lighting vectors. The esp32 receiver is capable of forwarding data over USB, Bluetooth, or Wifi. Hands on exercises with this sensor will be available to attendees to test their devices interactively with NARI lighting testbeds in the IoT Village.",
		"prereqs": [{
			"req": "Laptop with USB host port, internet capabilities, the Arduino IDE already installed, and a web browser."
		}],
		"equipment": [{
			"req": "All materials will be supplied: development board, cables, diodes, breadboard, etc."
		}],
		"takeHome": [{
			"req": "Light-based data exfiltration receiver."
		}]
	}, 
	{
		"title": "Sensing Things with Sensors and Things",
                "id": "sensing",
		"hidden": false,
		"instructor": [{
			"name": "Nathan Schlehlein",
			"twitter": "",
			"bio": "Nathan Schlehlein is a wannabe problem solver who earns his living making dreams come true for people via software. A semi-recent transplant to the semi-bustling city of Des Moines, IA, he resides in the “pretty OK” western burbs with his three awesome kids, long-suffering wife, & hyperactive dog. He is an enthusiast of intriguing, historically significant, & / or dangerous technology & enjoys good scotch, beer with a back story, & a well-executed fake foreign accent."
		}, {
			"name": "Clay Dowling",
			"twitter": "",
			"bio": "Clay Dowling is a software consultant specializing in agile practices & extremem programming techniques. In his spare time he builds machines driven by microcontrollers & negotiates with his cats for access to the keyboard."
		}],
		"courseLength": 2,
		"dates": [{
			"day": "Friday, March 27th",
			"time": "12:30 PM"
		}, {
			"day": "Friday, March 27th",
			"time": "3:00 PM"
		}],
		"minStudents": 10,
		"maxStudents": 30,
		"cost": 50,
		"trainingDescription": "Sure, the cloud is great, but here on the ground there is a lot of data worth observing. Just how does information on stuff like temperature, distance, or direction end up as data? As a participant of this hands-on workshop, you will get the opportunity to fire up and program a ESP32 based microcontroller board (that you get to take home!) and use it to interface, make sense of, and report on data from a variety of sensors.",
		"prereqs": [{
			"req": "Participants must bring thier own laptop with the Arduino IDE installed."
                },{
			"req": "Please follow the direcitons at https://gitlab.com/pithy.tech/kernelcon_handouts/blob/master/arduino_setup.md"
		}],
		"equipment": [{
			"req": "All equipment will be provided by the workshop: dev board, wires, breadboard, photocell, magnetometer, batteries, etc."
		}],
		"takeHome": [{
			"req": "Your own custom microcontroller, ready for sensing!"
		}]
	}
]
